# Part 1: Creating a database

Save all of your instructions in a script file - you will submit this file on Gnomio and github.

Create a database called “Umuzi”.

Create the following tables in the Umuzi database:
Customers
Employees
Orders
Payments
Products

In [ ]:
CREATE TABLE Customers(

    CustomerID SERIAL PRIMARY KEY,
    FirstName varchar(50),
    LastName varchar(50),
    Gender varchar,
    Address varchar(200),
    Phone bigint,
    Email varchar(100),
    City varchar(20),
    Country varchar(50)
);

INSERT INTO Customers VALUES(1,'John', 'Hibert', 'Male', '284 chaucer st', '084789657','john@gmail.com', 'Johannesburg', 'South Africa');
INSERT INTO Customers VALUES(2,'Thando', 'Sithole', 'Female', '240 Sect 1', '0794445584', 'thando@gmail.com', 'Cape Town', 'South Africa');
INSERT INTO Customers VALUES(3,'Leon', 'Glen', 'Male', '81 Everton Rd,Gillits', '0820832830', 'Leon@gmail.com', 'Durban', 'South Africa');
INSERT INTO Customers VALUES(4,'Charl', 'Muller', 'Male', '290A Dorset Ecke', '+44856872553', 'Charl.muller@yahoo.com', 'Berlin', 'Germany');
INSERT INTO Customers VALUES(5,'Julia', 'Stein', 'Female', '2 Wernerring', '+448672445058', 'Js234@yahoo.com', 'Frankfurt', 'Germany')



CREATE TABLE Emloyees(
    EmployeeID SERIAL PRIMARY KEY,
    FirstName varchar(50),
    LastName varchar(50),
    Address varchar(200),
    Email varchar(100),
    JobTitle varchar(20)
    FOREIGN KEY(EmployeeID) REFERENCES Orders(OrderId)
);

INSERT INTO Employees VALUES(1,'Kani', 'Matthew', 'mat@gmail.com', 'Manager');
INSERT INTO Employees VALUES(2,'Lesly', 'Cronje', 'LesC@gmail.com', 'Clerk');
INSERT INTO Employees VALUES(3,'Gideon', 'Maduku', 'm@gmail.com', 'Accountant')

CREATE TABLE Orders(
    OrderId SERIAL PRIMARY KEY,
    ProductID int,
    PaymentID int,
    FulfilledByEmployeeID int,
    DateRequired timestamp,
    DateShipped timestamp,
    Status varchar(20),
);

INSERT INTO Orders VALUES(1, 1, 1, 2, '05-09-2018', 'Nul', 'Not shipped');
INSERT INTO Orders VALUES(2,	1, 2, 2, '04-09-2018', '03-09-2018', 'Shipped');
INSERT INTO Orders VALUES(3, 3, 3, 3, '06-09-2018','Nul', 'Not shipped')

CREATE TABLE Payments(
    CustomerId SERIAL PRIMARY KEY,
    PaymentID int,
    PaymentDate timestamp,
    Amount decimal,
    FOREIGN KEY(PaymentID) REFERENCES Orders(OrderId)
);

INSERT INTO Payments VALUES(1, 1, '01-09-2018', 150.75);
INSERT INTO Payments VALUES(5, 2, '03-09-2018', 150.75);
INSERT INTO Payments VALUES(4, 3, '03-09-2018', 700.60)

CREATE TABLE Products(
    ProductID SERIAL PRIMARY KEY,
    ProductName varchar(100),
    Description varchar(300),
    BuyPrice decimal,
    FOREIGN KEY(ProductID) REFERENCES Orders(OrderId)
);

INSERT INTO Products VALUES(1, 'Harley Davidson Chopper', 'This replica features working kickstand, front suspension, gear-shift lever', 150.75);
INSERT INTO Products VALUES(2, 'Classic Car', 'Turnable front wheels, steering function', 550.75);
INSERT INTO Products VALUES(3, 'Sports car', 'Turnable front wheels', 'steering function', 700.60)

In [ ]:
import pandas as pd
from sqlalchemy.engine import create_engine

In [ ]:
#Part 2: Querying a database

# 1.SELECT ALL records from table Customers.
SELECT *
FROM Customers;

#2. SELECT records only from the name column in the Customers table.
SELECT FirstName
FROM Customers;

#3. Show the name of the Customer whose CustomerID is 1.
SELECT FirstName, LastName
FROM Customers
WHERE CustomerID = 1;

#4. UPDATE the record for CustomerID = 1 on the Customer table so that the name is “Lerato Mabitso”.
UPDATE Customers
SET FirstName = 'Lerato', LastName = 'Mabitso'
Where CustomerId = 1;

#5. DELETE the record from the Customers table for customer 2 (CustomerID = 2).
DELETE FROM Customers
WHERE CustomerID =2;

#6. Select all unique statuses from the Orders table and get a count of the number of orders for each unique status.
Select DISTINCT Status
FROM Orders and COUNT Status;

#7. Return the MAXIMUM payment made on the PAYMENTS table.
SELECT MAX(Amount)
FROM Payments;

#8. Select all customers from the “Customers” table, sorted by the “Country” column.
SELECT CustomerID
FROM Customers
ORDER BY Country;

#9. Select all products with a price BETWEEN R100 and R600.
SELECT BuyPrice
FROM Products
Where BuyPrice BETWEEN 100 and 600;

#10. Select all fields from “Customers” where country is “Germany” AND city is “Berlin”.
SELECT *
FROM Customers
WHERE Country = 'Germany' AND City = 'Berlin';

#11. Select all fields from “Customers” where city is “Cape Town” OR “Durban”.
SELECT *
FROM Customers
WHERE City = 'Cape Town' OR City = 'Durban';

#12. Select all records from Products where the Price is GREATER than R500.
SELECT *
FROM Products
WHERE BuyPrice > 500;

#13. Return the sum of the Amounts on the Payments table.
SELECT SUM(Amounts)
FROM Payments;

#14. Count the number of shipped orders in the Orders table.
SELECT COUNT(DateShipped)
FROM Orders;

#15. Return the average price of all Products, in Rands and in Dollars (assume the exchange rate is R12 to the Dollar).
SELECT AVG(BuyPrice) AS 'Rands', AVG(BuyPrice/12) AS 'Dollars';


#16. Using INNER JOIN create a query that selects all Payments with Customer information.
SELECT *
FROM Payments
INNER JOIN Customers
ON Payments * = Customers *;

#17. Select all products that have turnable front wheels.
SELECT Description
FROM Products
WHERE Description = 'Turnable front wheels',